# Структура квиза
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
{
        'question': 'Кому принадлежит ресторан The Сад?',
        'options': ['Ургант и Цекало', 'Цекало', 'Ургант', 'Мне'],
        'correct_option': 0
    },
{
        'question': 'Имя матери Александра Македонского?',
        'options': ['Анна', 'Янина', 'Олимпиада', 'Ксения'],
        'correct_option': 2
    },
{
        'question': 'Кто такой большой зайцегуб?',
        'options': ['Заяц', 'Муравьед', 'Тапир', 'Летучая мышь'],
        'correct_option': 3
    },
{
        'question': 'Сколько километров в одной миле?',
        'options': ['1.6', '1', '1.3', '0.9'],
        'correct_option': 0
    },
{
        'question': 'Что изучает селенолог?',
        'options': ['Луну', 'Морских животных', 'Траву', 'Клетки кожи'],
        'correct_option': 0
    },
{
        'question': 'Самое известное изобретение Альфреда Нобеля?',
        'options': ['Ложка', 'Динамит', 'Фотоаппарат', 'Ничего'],
        'correct_option': 1
    },
{
        'question': ' Как переводится с французского языка слово «фуршет»?',
        'options': ['Ложка', 'Вилка', 'Еда', 'Нож'],
        'correct_option': 1
    },
{
        'question': 'У семи братьев есть по сестре. Сколько в семье детей?',
        'options': ['7', '6', '1', '8'],
        'correct_option': 0
    },
{
        'question': 'Одно яйцо варится 10 минут. Сколько минут будут вариться 5 яиц?',
        'options': ['10', '20', '50', '5'],
        'correct_option': 0
    },
{
        'question': 'Кто автор оперы «Евгений Онегин»?',
        'options': ['Чайковский', 'Бетховен', 'Моцарт', 'Глинка'],
        'correct_option': 0
    },
{
        'question': 'Сколько струн у скрипки?',
        'options': ['1', '2', '3', '4'],
        'correct_option': 3
    },
    # Добавьте другие вопросы
]